Can't create sweep.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotDrawSweep { get; }
  Visual Basic
Public Shared ReadOnly Property CannotDrawSweep As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotDrawSweep {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SweepFailures Class
  Autodesk.Revit.DB Namespace